Script started on 2025-11-05 04:53:52
$ ./disk_server 9090 4 8 100 ./disk.img --sync=after
disk_server listening on 9090 (cyl=4 sec=8 track_us=100 sync=after)

# --- Terminal A: CLI client (basic + edge cases) ---
$ ./disk_client_cli 127.0.0.1 9090
Connected. Type commands: I | R c s | W c s l
> I
Server geometry: 4 8
> R 0 0
READ OK (c=0 s=0)
0000 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0010 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0020 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0030 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0040 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0050 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0060 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0070 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
> W 0 0 0
DATA: enter exactly 0 bytes (printable); shorter will be zero‑filled)
WRITE OK
> R 0 0
READ OK (c=0 s=0)
0000 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0010 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0020 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0030 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0040 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0050 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0060 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0070 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
> W 1 2 8
DATA: enter exactly 8 bytes (printable); shorter will be zero‑filled)
ABCDEFGH
WRITE OK
> R 1 2
READ OK (c=1 s=2)
0000 : 41 42 43 44 45 46 47 48 00 00 00 00 00 00 00 00  | ABCDEFGH........
0010 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0020 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0030 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0040 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0050 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0060 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
0070 : 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00  | ................
> R -1 0
READ: invalid c/s
> R 99 0
READ: invalid c/s
> W 0 8 3
DATA: enter exactly 3 bytes (printable); shorter will be zero‑filled)
abc
WRITE FAILED
> W 0 0 129
l must be 0..128
> exit

# --- Terminal B: Random client (concurrency & stability) ---
$ ./disk_client_rand 127.0.0.1 9090 50 123
Geometry: cyl=4 sec=8
WRRWRRWRWRRWRWRRWRRWRWRRWRWRRWRWRWRRWRRWRWRWRRWRR
$ 

# --- Terminal C: Burst clients (denial-of-service simulation) ---
$ for i in $(seq 1 10); do ./disk_client_rand 127.0.0.1 9090 200 $i & done; wait
# (All clients finish; server stayed responsive.)

$ 
Script done on 2025-11-05 04:56:09
